`timescale 1ns / 1ps

module instruction_mem (
    input  logic [31:0] instr_addr,
    output logic [31:0] instr_code
);
    logic [31:0] instr_rom[0:15];

    initial begin
        // =========================================================================
        // 1. 레지스터 초기화 구간
        // =========================================================================
        // [PC: 0x00] ADDI x3, x0, 4   -> x3 = 32'h0000_0004 (Base Address 1)
        instr_rom[0]  = 32'h0040_0193; 
        
        // [PC: 0x04] ADDI x4, x0, 8   -> x4 = 32'h0000_0008 (Base Address 2)
        instr_rom[1]  = 32'h0080_0213; 
        
        // [PC: 0x08] ADDI x2, x0, -90 -> x2 = 32'hFFFF_FFA6 
        // (테스트용 소스 데이터. A6는 1010_0110으로 최상위 비트가 1인 음수 형태)
        instr_rom[2]  = 32'hfa60_0113; 

        // =========================================================================
        // 2. 메모리 저장 (Store) 테스트 구간
        // =========================================================================
        // [PC: 0x0C] SW x2, 0(x3) -> Mem[4]에 32'hFFFF_FFA6 전체 저장
        instr_rom[3]  = 32'h0021_a023; 
        
        // [PC: 0x10] SB x2, 0(x4) -> Mem[8]에 8'hA6 저장 (1바이트)
        instr_rom[4]  = 32'h0022_0023; 
        
        // [PC: 0x14] SH x2, 2(x4) -> Mem[10]에 16'hFFA6 저장 (2바이트)
        instr_rom[5]  = 32'h0022_1123; 

        // =========================================================================
        // 3. 메모리 로드 (Load) 확장 검증 구간
        // =========================================================================
        // [PC: 0x18] LB x10, 0(x4)  -> Mem[8]의 A6를 읽어 부호 확장
        instr_rom[6]  = 32'h0002_0503; 
        
        // [PC: 0x1C] LBU x11, 0(x4) -> Mem[8]의 A6를 읽어 제로 확장
        instr_rom[7]  = 32'h0002_4583; 
        
        // [PC: 0x20] LH x12, 2(x4)  -> Mem[10]의 FFA6를 읽어 부호 확장
        instr_rom[8]  = 32'h0022_1603; 
        
        // [PC: 0x24] LHU x13, 2(x4) -> Mem[10]의 FFA6를 읽어 제로 확장
        instr_rom[9]  = 32'h0022_5683; 
        
        // [PC: 0x28] LW x14, 0(x4)  -> Mem[8]에서 32비트 전체 리드
        instr_rom[10] = 32'h0002_2703;

        // 패딩
        instr_rom[11] = 32'h0000_0000;
        instr_rom[12] = 32'h0000_0000;
        instr_rom[13] = 32'h0000_0000;
        instr_rom[14] = 32'h0000_0000;
        instr_rom[15] = 32'h0000_0000;
    end

    assign instr_code = instr_rom[instr_addr[31:2]];

endmodule